{
  "kalimas": [
    {
      "number": 1,
      "title_en": "First Kalima (Tayyab)",
      "arabic": "لا إله إلا الله محمد رسول الله",
      "english": "There is no God Besides Allah, Hazrat Muhammad (SAW) is his messenger."
    },
    {
      "number": 2,
      "title_en": "Second Kalima (Shahadah)",
      "arabic": "أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله",
      "english": "I bear witness that there is none worthy of worship except Allah, the one alone, without any partner, and I bear witness that Muhammad (P.B.U.H) is his servant and messenger."
    },
    {
      "number": 3,
      "title_en": "Third Kalima (Tamjeed)",
      "arabic": "سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم",
      "english": "Glory (is for) Allah. And all praises for Allah. And (there is) none worthy of worship except Allah. And Allah is the Greatest. And (there is) no power and no strength except from Allah, the Most High, the Most Great."
    },
    {
      "number": 4,
      "title_en": "Fourth Kalima (Tawheed)",
      "arabic": "لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو حي لا يموت أبدا أبدا ذو الجلال والإكرام بيده الخير وهو على كل شيء قدير",
      "english": "There is none worthy of worship except ALLAH. He is alone and has no partner. To Him belongs the Kingdom and for HIM is all praise. HE gives life and causes death. In HIS hand is all good and HE has power over everything."
    },
    {
      "number": 5,
      "title_en": "Fifth Kalima (Astaghfar)",
      "arabic": "أستغفر الله ربي من كل ذنب أذنبته عمدا أو خطأ سرا أو علانية وأتوب إليه من الذنب الذي أعلم ومن الذنب الذي لا أعلم إنك أنت علام الغيوب وستار العيوب وغفار الذنوب ولا حول ولا قوة إلا بالله العلي العظيم",
      "english": "I seek forgiveness from ALLAH, who is my Creator and Cheriser, from every sin I committed knowingly or unknowingly, secretly or openly. I also seek His forgiveness for all sins which I am aware of or am not aware of. Certainly You (O ALLAH!), are the Knower of the hidden and the Concealer of mistakes and the Forgiver of sins. And there is no power and no strength except with ALLAH, the Most High, the Most Great."
    },
    {
      "number": 6,
      "title_en": "Sixth Kalima (Radd-e-Kufr)",
      "arabic": "اللهم إني أعوذ بك من أن أشرك بك شيئا وأنا أعلم به وأستغفرك لما لا أعلم به تبت عنه وتبرأت من الكفر والشرك والكذب والغيبة والبدعة والنميمة والفواحش والبهتان والمعاصي كلها وأسلمت وأقول لا إله إلا الله محمد رسول الله",
      "english": "O ALLAH! Certainly I seek protection with You from, that I associate partner with You anything and I know it. And I seek forgiveness from You for that I do not know it. I repented from it and I made myself free from disbelief and polytheism and the falsehood and the back-biting and the innovation and the tell-tales and the bad deeds and the blame and the disobedience, all of them. And I submit and I say (there is) none worthy of worship except ALLAH, Muhammad is the Messenger of ALLAH."
    }
  ]
}
